[{"title":"Insane Levels of Customization","message":"I was completely shocked when I started playing Thunder Warrior: Genesis. I couldn\t believe the fact that I was able to create my own custom character with just so many options! I wholeheartedly recommend this game to anyone who is considering it.","rating":5,"username":"EddieTheCrusher"},{"title":"Awesome","message":"This is by far the best free game that I have ever played. Yet, I feel like its still missing something.","rating":4.5,"username":"MegaCamper"},{"title":"Great, but...","message":"This game is just so much fun! I really enjoy the detalied combat you guys created. It is so easy to pick up at first, but it is has enough depth that it takes time to truly master. I have had so much fun equipping my lightsaber and slicing up foes or reflecting their own attacks back at them! The one issue I have found in the game was the way lightsaber hits sometimes seem to have a slightly larger range than the animation. \n Edit: They fixed it and I'm changing my rating to a five. Thank you for all the great work!","rating":5,"username":"sharkface"},{"title":"These graphics are outstanding!","message":"I literally can\t believe how insane this game's graphics are. A friend told me that it's just one guy making the whole thing and if that's trut then just wow! I coul like stare at those animations all day...","rating":5,"username":"Max"},{"title":"A Truly Unique Game for Everyone","message":"This game is just so unique. I've played some top down shooters before, but none of them have been as beautiful as this. It just gives so many options, from the way you play and customizing your settings to all of your diferent equipment and abilities. I really hate how some games lock you in with one out of a few predefined characters. This system is so much more fun where you get to build your own character. I have multiple accounts now, each with its own character. It's just so fun. A warning for anyone reading this and interested in making multiple characters too. You can't use the same email for each account, so you have to either use a new email that you already have or just create another email. I like just adding the numbers 1, 2, 3 and so on to the end of my email to make more for things like this.","rating":5,"username":"ClarkDaLark"},{"title":"Unlimited POWER!!!","message":"I feel like emporer palpeting with all these awsome abilites. I can burn through anyone with my lightning attacks. Thaumaturgy is just so cool! I based my whole build around making the most powerful possible lightning abilities to recreate palpetine and it just rocks!s","rating":4,"username":"PalpPower"},{"title":"Spaceships Please!","message":"Please, Please add spaceships! This game is just so fun to play, but there is something that it is really lacking! Spaceships! It would be so fun to fly over everyone else and can we have ship to ship combat to? Or mayby be able to board each other's ships? Please? Ask anyone you want and I bet they'll say that thwy want sapceships too. Just please add spaceships.","rating":4.5,"username":"SusannasCookieIsOverThere"},{"title":"Total Ripoff","message":"What the heck do you guys think you are doing? This game is a total rip off! Zero stars for you. I can't believe you even made that an option.","rating":0,"username":"LucyLemons"},{"title":"Seriously Lucy?","message":"Im just putting a review of this to say how wrong Lucy is. I have been playing this game for a while now and know what I am talking about. All the content here is one hundred percent original. Sure, it makes some pretty obvious refrences, but all of the models, animations, abilities, and combat systems were made by the developers themselves. I've been playing this game from the start and have seen the changes it went through. Stop being so sour.","rating":5,"username":"360noscope"},{"title":"Why are the usernames so limited?","message":"Really, the game is great and all, but I feel that the usernames are so limited. You only allow letters and numbers and not even spaeces? Really? Why don\t you just expand the options already? But other than that, the game is so fun! Camping behind obstacles and stabbing or sniping losers is just great.","rating":4.5,"username":"yourDadIsATurtl3"},{"title":"Damn, Man. Yu gotta come try this!","message":"The Thunder Warrior Experience has just been awesome. The game is so fun and I got my first insane weapon yesterday! I can't wait to get back to shredding all of those noobs (disclaimer:, I don't actually unleash my full power on actual noobs, but in comparison to me and my dope gun, everyone is a noob) The one issue is that now every other game I play just feels so bland. Like why would I ever want yo play something else after this dope game?","rating":5,"username":"You"},{"title":"I am impressed","message":"After playing games on the console and the play to play games on PC, I never thought I would be able to get into a browser game again. But the gameplay is just so much more fun than all those other games. I love tricking out my equipment with all sorts of cool mods and stuff. It's just great!","rating":5,"username":"awesomeninja14"}]